[
    {   
        "company": "ASRC Federal",
        "title": "Associate Software Developer",
        "description": "I have the pleasure to work with an agile team in the command and control deparment to maintain a messaging infrastructure for navy ships. My responsibilities involved working cross-functionally to patch an issue, develop new features to meet requirements, particpating in code reviews, and refactoring legacy code for better reusability and extensibility",
        "picture": "images/ship.jpg",
        "skills": ["C++", "git", "Clearcase", "Jira", "Bitbucket", "Maven", "Unix"]
    },
    {
        "company": "Multiplayer Game",
        "title": "Flappybird",
        "description": "Created an online server-authoritative multiplayer game of Flappybird using sockets, allowing players to play against an opponent to see who can fly the furthest!",
        "picture": "images/FlappyProject.jpg",
        "link": "https://multiplayer-flappybird.vercel.app/",
        "skills": ["Javascript", "React", "Node.js", "Next.js", "socket.io", "HTML", "CSS"]
    },
    {
        "company": "Black Desert Online",
        "title": "Profit Tracker",
        "description": "This website helps Black Desert Online players calculate profitability of various popular ingame activities to optimize their daily income. It also tracks the history of sales for all microtransactions that is listed on a centralized marketplace to help players determine what players are buying with real money and selling on the ingame market.",
        "picture": "images/BDOImage.jpg",
        "link": "https://bdotracker.netlify.app/",
        "skills": ["Python", "Django", "React", "JavaScript", "HTML", "CSS", "MySQL"]
    },
    {
        "company": "McCabe-Thiele",
        "title": "Binary Distillation Solver",
        "description": "This website quickly performs the McCabe-Thiele graphical method to determine the number of stages required for a binary distillation solver. With built-in validation, users will always get their answer and are guided with tooltips and notifications to help solve their problem. ",
        "picture": "images/binaryColumn.jpg",
        "link": "https://da593.github.io/ReactBinary/", 
        "skills": ["JavaScript", "React", "HTML", "CSS"]
    }
]